openfoam9/tutorials/multiphase/multiphaseEulerFoam/laminar/injection/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    selectionMode   points;
    points
    (
        (0.075 0.2 0.05)
    );

    phase           air;
    rho             thermo:rho.air;

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           0.1;
        duration        5;
        value           1e-3;
    }

    fieldValues
    {
        U.air       (0 -10 0);
        T.air       300;
    }
}


// ************************************************************************* //
